# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConicalSurface..::..Origin Property
ConicalSurface Class See Also
---
Apex of the cone. This is the origin of the local coordinate system associated with this cone.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace